String[] names = {
    "Дадабаев А.Т", "Иванов Т.Л","Самсонов Р.Н", "Ершов Я.Р", "Зыков В.Ф", "Силин М.В", 
    "Кудрявцев Е.Т","Пахов Ф.А","Одинцов М.М","Макаров А.С", "Федотов М.С","Казаков М.С",
    "Мартынов Л.Г","Носков П.Г","Киселёв Е.Д", "Юдин Г.В","Потапов С.Г","Лазарев С.Г"
};

String[] lessons = {
    "Информатика","Литература","Математика","Русский","Литература","Математика",
    "Русский","Литература","Информатика","Математика","Математика","Русский",
    "Математика","Информатика","Информатика","Русский","Математика","Литература",
};

String[] mark = {
    "_3_","_2_","_5_","_4_","_2_","_4_","_3_","_2_",
    "_5_","_3_","_5_","_3_","_5_","_3_","_5_","_2_",
    "_5_", "_3_",
    "_5_","_4_","_5_","_4_","_5_","_4_","_5_","_5_",
    "_5_","_5_","_5_","_4_","_5_","_4_","_5_","_4_",
    "_5_", "_4_"
};

string start = "| [0] \t Фамилия И.О \t  Предмет\tОценка  \tПровер.\t Размер |";
Console.WriteLine(start);
for (int i = names.GetLowerBound(0); i < names.GetUpperBound(0)+1; i++){
    string namesby = names[i];
    int lenghtst = namesby.Length;
    string lessonsby = lessons[i];
    int lenghtle = lessonsby.Length;
    string markby1 = mark[i];
    int markby1le = markby1.Length;
    string markby2 = mark[i+17];
    int markby2le = markby2.Length;
    Console.WriteLine($"| [{i+1}] \t {names[i]} \t {lessons[i]} \t {mark[i]} \t --> \t {mark[i+17]} \t {lenghtst*2 + lenghtle*2 + markby1le*2 + markby2le*2 + 4} байт|");
};

